In [1]:
import numpy as np
import pandas
from pandas import Series,DataFrame

In [2]:
name=['lilei','jack','mery','luck','tom','bob','lili','hanmeimei']
data=np.random.randint(20,100,size=(8,2))
columns=['python','java']
df=DataFrame(data=data,index=name,columns=columns)
df

           python  java
lilei          45    51
jack           55    73
mery           63    77
luck           72    91
tom            86    74
bob            57    90
lili           88    81
hanmeimei      93    90

In [29]:
dic={
    'python':[45,55,63,72,86,57,88,93],
    'java':[51,73,77,91,74,90,81,90]
}
df=DataFrame(data=dic,index=name)
df

           python  java
lilei          45    51
jack           55    73
mery           63    77
luck           72    91
tom            86    74
bob            57    90
lili           88    81
hanmeimei      93    90

In [4]:
a=df[df['python']>60]
a=a[a['java']>70]
a

           python  java
mery           63    77
luck           72    91
tom            86    74
lili           88    81
hanmeimei      93    90

In [69]:
df[df.python>df.python.mean()]

           python  java
luck           72    91
tom            86    74
lili           88    81
hanmeimei      93    90

In [5]:
df['java']

lilei        51
jack         73
mery         77
luck         91
tom          74
bob          90
lili         81
hanmeimei    90
Name: java, dtype: int64

In [67]:
df.loc[df.iloc[2:3,:].index,'java']=76
df

           python  java
lilei          45    51
jack           70    73
mery           63    76
luck           72    91
tom            86    74
bob            57    90
lili           88    81
hanmeimei      93    90

In [64]:
df.iloc[2:3,:].index

Index(['mery'], dtype='object')

In [14]:
df.iloc[[2,4]]

      python  java
mery      63    77
tom       86    74

In [36]:

df.loc[['lilei','hanmeimei'],'python']

lilei        45
hanmeimei    93
Name: python, dtype: int64

In [34]:
df.loc['jack','python'] =70
df

           python  java
lilei          45    51
jack           70    73
mery           63    77
luck           72    91
tom            86    74
bob            57    90
lili           88    81
hanmeimei      93    90